Revit 2027 API
ReferenceArray Class
An array that contains reference objects.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.ReferenceArray
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ReferenceArray : APIObject,
	IEnumerable
Public Class ReferenceArray
	Inherits APIObject
	Implements IEnumerable
public ref class ReferenceArray : public APIObject,
	IEnumerable
type ReferenceArray =
    class
        inherit APIObject
        interface IEnumerable
    end
The ReferenceArray type exposes the following members.
Constructors
Name | Description
ReferenceArray | Initializes a new instance of the ReferenceArray class
Top
Properties
Name | Description
IsEmpty | Test to see if the array is empty.
IsReadOnly | Identifies if the object is read-only or modifiable.
(Inherited from APIObject)
Item | Gets or sets a reference at a specified index within the array.
Size | Returns the number of references that are in the array.
Top
Methods
Name | Description
Append | Add the reference to the end of the array.
Clear | Removes every reference from the array, rendering it empty.
Dispose | Causes the object to release immediately any resources it may be utilizing.
(Inherited from APIObject)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
ForwardIterator | Retrieve a forward moving iterator to the array.
GetEnumerator | Retrieve a forward moving iterator to the array.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
Insert | Insert the specified reference into the array.
ReverseIterator | Retrieve a backward moving iterator to the array.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB Namespace